In [ ]:
import pandas as pd
import numpy as np
data=pd.DataFrame({'name':['geetha','seetha','kavya','siri','hari','priay','mouni'],'Age':[22,18,22,22,25,21,23],
                   'area':['hyd','ameer','begam','sham','kay','lal','tank']})

# Pandas is an open-source Python Library providing high-performance data manipulation and analysis tool using its powerful data structures.
Key Features of Pandas
Fast and efficient DataFrame object with default and customized indexing.
Tools for loading data into in-memory data objects from different file formats.
Data alignment and integrated handling of missing data.
Reshaping and pivoting of date sets.
Label-based slicing, indexing and subsetting of large data sets.
Columns from a data structure can be deleted or inserted.
Group by data for aggregation and transformations.
High performance merging and joining of data.
Time Series functionality.

In [ ]:
data

In [8]:
k=data[data['Age']==22]
z=k.Age.count()
print("z is :",z)

z is : 3

In [9]:
data.name

0    geetha
1    seetha
2     kavya
3      siri
4      hari
5     priay
6     mouni
Name: name, dtype: object

In [55]:
data.values

array([['geetha', 22, 'hyd', 2.0],
       ['seetha', 18, 'ameer', 3.0],
       ['kavya', 22, 'begam', 4.0],
       ['siri', 22, 'sham', 7.0],
       ['hari', 25, 'kay', 5.0],
       ['priay', 21, 'lal', 9.0],
       ['mouni', 23, 'tank', nan]], dtype=object)

In [10]:
data.name[3]

'siri'

In [11]:
import numpy as np
np.logical_or(name, Age)
np.logical_and(name, Age)
x | y
x&y

g=data([data.Age==25]and[data.area=='hyd'])
g

NameError: name 'name' is not defined

In [12]:
data1= data[(data['Age']>22) & (data['Age']<30)]
data1

    name  Age  area
4   hari   25   kay
6  mouni   23  tank

In [13]:
data.name=='geetha':
        print(data.name[4])

SyntaxError: invalid syntax (<ipython-input-13-8f47183cacb5>, line 1)

In [14]:
data.sort_values('Age',ascending=True)
#data.Age.sort_values()

     name  Age   area
1  seetha   18  ameer
5   priay   21    lal
0  geetha   22    hyd
2   kavya   22  begam
3    siri   22   sham
6   mouni   23   tank
4    hari   25    kay

In [15]:
#data.name.sort_values()
data.sort_values('name')

     name  Age   area
0  geetha   22    hyd
4    hari   25    kay
2   kavya   22  begam
6   mouni   23   tank
5   priay   21    lal
1  seetha   18  ameer
3    siri   22   sham

In [16]:
np.random.uniform(0,2,10)

array([1.59081974, 0.26099653, 1.20897562, 0.29095444, 0.0495701 ,
       1.98924388, 0.36456482, 0.1446119 , 1.64430783, 1.24636744])

In [17]:

data[data.Age>=22]

     name  Age   area
0  geetha   22    hyd
2   kavya   22  begam
3    siri   22   sham
4    hari   25    kay
6   mouni   23   tank

In [18]:
import pandas as pd
data['class']=pd.Series([2,3,4,7,5,9])
data

     name  Age   area  class
0  geetha   22    hyd    2.0
1  seetha   18  ameer    3.0
2   kavya   22  begam    4.0
3    siri   22   sham    7.0
4    hari   25    kay    5.0
5   priay   21    lal    9.0
6   mouni   23   tank    NaN

In [19]:
data.fillna(9)

     name  Age   area  class
0  geetha   22    hyd    2.0
1  seetha   18  ameer    3.0
2   kavya   22  begam    4.0
3    siri   22   sham    7.0
4    hari   25    kay    5.0
5   priay   21    lal    9.0
6   mouni   23   tank    9.0

In [20]:
o=data[data['Age']==18]
o['name']

1    seetha
Name: name, dtype: object

In [21]:
data.isnull().count()

name     7
Age      7
area     7
class    7
dtype: int64

In [22]:
data

     name  Age   area  class
0  geetha   22    hyd    2.0
1  seetha   18  ameer    3.0
2   kavya   22  begam    4.0
3    siri   22   sham    7.0
4    hari   25    kay    5.0
5   priay   21    lal    9.0
6   mouni   23   tank    NaN

In [49]:
l=data[data['class'].isnull()]
l['name']

6    mouni
Name: name, dtype: object

In [51]:

data.isnull().values.any()

True

In [23]:
data.values

array([['geetha', 22, 'hyd', 2.0],
       ['seetha', 18, 'ameer', 3.0],
       ['kavya', 22, 'begam', 4.0],
       ['siri', 22, 'sham', 7.0],
       ['hari', 25, 'kay', 5.0],
       ['priay', 21, 'lal', 9.0],
       ['mouni', 23, 'tank', nan]], dtype=object)

In [54]:
k=data[data.values==22]
k

     name  Age   area  class
0  geetha   22    hyd    2.0
2   kavya   22  begam    4.0
3    siri   22   sham    7.0

In [63]:
l=[3,5,6,7,1,8,4]
sorted(l,reverse=True)

[8, 7, 6, 5, 4, 3, 1]

In [64]:
l.sort(key=str.lower)
l

TypeError: descriptor 'lower' requires a 'str' object but received a 'int'